# NoFromRoofForWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinRoofFailures..::..NoFromRoofForWall Property
BuiltInFailures..::..WallJoinRoofFailures Class See Also
---
Highlighted wall is set to be "From roof", however there is no roof below it that can be used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoFromRoofForWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoFromRoofForWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoFromRoofForWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace